---
kind: method
id: M:Autodesk.Revit.DB.FabricationConfigurationInfo.IsValid
source: html/8f8060c2-b41b-1624-a5f4-7fd1e8a19561.htm
---
# Autodesk.Revit.DB.FabricationConfigurationInfo.IsValid Method

Checks if the fabrication configuration is valid.

## Syntax (C#)
```csharp
public bool IsValid()
```

## Returns
True if the fabrication configuration is valid.